# role or task template

# 输入问题，输出分数，不需要严格的格式化输出
ANALYSE_SCORE_TEMPLATE = """# 角色 #
你是一个化工问题难度的打分器，你擅长根据化工问题的**复杂程度(complexity)**和其**资料的可访问性(accessibility)**对其进行打分。
>>>>>>>>>>>>>>>>>>>>>>
# 定义 #
- 复杂程度(complexity)和资料的可访问性(accessibility)的分数范围都在1到10之间
- 复杂程度(complexity): 化工问题的复杂程度，1表示基本，常识性的化工问题，10表示复杂，需要专业知识的化工问题，从1到10表示从简单到复杂
- 资料的可访问性(accessibility): 访问化工问题相关资料的难度，1表示通过简单的网络搜索就能得到，10表示需要从专业知识库中获取相关知识，从1到10表示访问简单到访问困难
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
现在有一个问题，如果问题与化工相关，需要你分析该化工问题的复杂程度(complexity)和资料的可访问性(accessibility)，给出两个指标对应的分数，并使用提供的**复杂程度权重(complexity weight)**和**可访问性权重(accessibility weight)**计算二者的加权和，得到最终得分
如果问题与化工并不相关，其复杂程度分数为0，可访问性分数为0
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 参考样例 #
{example}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 问题 #
{question}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 权重 #
- 复杂程度权重(complexity weight): {complexity_weight}
- 可访问性权重(accessibility weight): {accessibility_weight}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
<对化工问题复杂程度的分析> 复杂程度为:<复杂程度分数>
<对化工问题可访问性的分析> 可访问性:<可访问性分数>
<加权和计算过程> 最终得分:<最终得分>
<<<<<<<<<<<<<<<<<<<<<<

"""

# 输入问题和现在的结果，输出是否结束的分析，不需要格式化输出
ANALYSE_FINISH_TEMPLATE = """# 角色 #
你是一个问答系统中的分析者
>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
现在有一个【化工问题】，系统已经根据该问题得到一些【现有结果】，请根据【现有结果】，分析系统当前获得的信息是否回答【化工问题】。
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 化工问题 #
问题: {question}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 现有结果 #

{pre_result}

<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
<对现状的分析>
<是否足以回答问题>
<<<<<<<<<<<<<<<<<<<<<<

"""

# 输入分析，输出下一步，要求格式化输出，最后输出为 下一步：balabala
DECIDE_NEXT_STEP_TEMPLATE = """# 角色 #
你是一个判断状态是否转换的决策器

>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
请你根据 1.当前的【化工问题】，2.【上一步状态】，3.已经获得的【当前结果】，4.【状态转化的规则】 决定下一步的状态
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 定义 #
- 【化工问题】: 用户输入的化工问题
- 【上一步状态】: 上一个状态，辅助决定下一步的状态
- 【当前结果】: 当前搜集到的信息，用于判断下一步状态的选择
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 状态转换规则 #
1. 状态说明
    - Start: 对化工问题进行回答的开始状态
    - Retrieve: 从专家知识库中检索到化工问题的相关知识
    - WebSearch: 从互联网中搜索得到化工问题的相关知识
    - Lookup: 对检索(Retrieve)或者搜索(WebSearch)获得的信息中凝练知识
    - Finish: 结束状态转换，从现有的信息中产生回答
2. 允许的下一步转换状态：Retrieve, WebSearch, Finish
3. 如果上一步状态为 Start，则判断【当前结果】中的分数
    - 如果分数小于 3，则下一步状态为 Finish
    - 如果分数大于 3 且 小于 6，则下一步状态为 WebSearch
    - 如果分数大于 6，则下一步状态为 Retrieve
4. 如果上一步状态不是 Start，请分析判断【当前结果】是否足以回答【化工问题】
    - 如果不足以回答，同时【化工问题】比较简单，则下一步状态为 WebSearch
    - 如果不足以回答，同时【化工问题】比较复杂，则下一步状态为 Retrieve
    - 如果足以回答，则下一步状态为 Finish
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 上一步状态 #
{pre_state}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 当前结果 #
{pre_results}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出的参考样例 #
以下是最终输出的参考样例
{example}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 化工问题 #
问题: {question}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
上一步状态为 <填入上一步状态>
分析：
<决定下一步状态进行的推断> 

下一步状态：<状态>
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 提示 #
下一步状态仅允许在 Retrieve, WebSearch, Finish中选择
<<<<<<<<<<<<<<<<<<<<<<

"""

#TODO Lookup 的提示词，回答的提示词，应该比较简单
LOOKUP_TEMPLATE = """# 角色 #
你是一个文档阅读器，你擅长从大量文本中获得与【问题】高度相关的信息

>>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
为了回答【问题】，请从【现有资料】中检索，找到与【问题】相关的信息
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 任务要求 #
1. 如果【现有资料】与【问题】相关，仅从资料中寻找出相关信息，不生成新信息

<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 现有资料 #
{pre_result}
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 问题 #
{question}
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
<查找到的信息>
<<<<<<<<<<<<<<<<<<<<<<<

"""

ANSWER_TEMPLATE = """# 角色 #
你是一个化工专家，你擅长结合【知识】回答【化工问题】

>>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
现有一个【化工问题】和相关的【知识】，请结合【知识】对【化工问题】进行回答
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 任务说明 #
1. 【知识】中包含对问题的分析和问题相关的资料
2. 请结合分析和资料严谨地回答问题
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 知识 #
{pre_results}
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 化工问题 #
{question}
<<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
对问题的回答
<<<<<<<<<<<<<<<<<<<<<<<

"""