# role or task template

# 输入问题，输出分数，不需要严格的格式化输出
ANALYSE_SCORE_TEMPLATE = """# 角色 #
你是一个化工问题难度的打分器，你擅长根据化工问题的**复杂程度(complexity)**和其**资料的可访问性(accessibility)**对其进行打分。
>>>>>>>>>>>>>>>>>>>>>>
# 定义 #
- 复杂程度(complexity)和资料的可访问性(accessibility)的分数范围都在1到10之间
- 复杂程度(complexity): 化工问题的复杂程度，1表示基本，常识性的化工问题，10表示复杂，需要专业知识的化工问题，从1到10表示从简单到复杂
- 资料的可访问性(accessibility): 访问化工问题相关资料的难度，1表示通过简单的网络搜索就能得到，10表示需要从专业知识库中获取相关知识，从1到10表示访问简单到访问困难
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
现在有一个【化工问题】，需要你分析该【化工问题】的复杂程度(complexity)和资料的可访问性(accessibility)，给出两个指标对应的分数，并使用提供的**复杂程度权重(complexity weight)**和**可访问性权重(accessibility weight)**计算二者的加权和，得到最终得分
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 参考样例 #
{example}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 化工问题 #
问题: {question}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 权重 #
- 复杂程度权重(complexity weight): {complexity_wight}
- 可访问性权重(accessibility weight): {accessibility_weight}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
<对化工问题复杂程度的分析> 复杂程度为:<复杂程度分数>
<对化工问题可访问性的分析> 可访问性:<可访问性分数>
<加权和计算过程> 最终得分:<最终得分>
<<<<<<<<<<<<<<<<<<<<<<

"""

# 输入问题和现在的结果，输出是否结束的分析，不需要格式化输出
ANALYSE_FINISH_TEMPLATE = """# 角色 #
你是一个
>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
现在有一个【化工问题】，需要你分析该【化工问题】的复杂程度(complexity)和资料的可访问性(accessibility)，给出两个指标对应的分数，并使用提供的**复杂程度权重(complexity weight)**和**可访问性权重(accessibility weight)**计算二者的加权和，得到最终得分
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 参考样例 #
{example}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 化工问题 #
问题: {question}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 权重 #
- 复杂程度权重(complexity weight): {complexity_wight}
- 可访问性权重(accessibility weight): {accessibility_weight}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
<对化工问题复杂程度的分析> 复杂程度为:<复杂程度分数>
<对化工问题可访问性的分析> 可访问性:<可访问性分数>
<加权和计算过程> 最终得分:<最终得分>
<<<<<<<<<<<<<<<<<<<<<<
"""

# 输入分析，输出下一步，要求格式化输出，最后输出为 下一步：balabala
DECIDE_NEXT_STEP_TEMPLATE = """# 角色 #
你是一个判断状态是否转换的决策器

>>>>>>>>>>>>>>>>>>>>>>
# 任务 #
请你根据 1.当前的【化工问题】，2.【上一步状态】，3.已经获得的【当前结果】，4.【状态转化的规则】 决定下一步的状态
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 定义 #
- 【化工问题】: 用户输入的化工问题
- 【上一步状态】: 上一个状态，辅助决定下一步的状态
- 【当前结果】: 当前搜集到的信息，用于判断下一步状态的选择
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 状态转换规则 #
1. 允许的下一步转换状态：Retrieve, WebSearch, Finish
2. 状态说明
    - Start: 对化工问题进行回答的开始状态
    - Retrieve: 从专家知识库中检索到化工问题的相关知识
    - WebSearch: 从互联网中搜索得到化工问题的相关知识
    - Lookup: 对检索(Retrieve)或者搜索(WebSearch)获得的信息中凝练知识
    - Finish: 结束状态转换，从现有的信息中产生回答
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 参考样例 #
{example}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 化工问题 #
问题: {question}
<<<<<<<<<<<<<<<<<<<<<<

>>>>>>>>>>>>>>>>>>>>>>
# 输出格式 #
<决定下一步状态进行的推断> 
下一步状态：<状态>
<<<<<<<<<<<<<<<<<<<<<<

"""

LOOKUP_TEMPLATE = """"""

ANSWER_TEMPLATE = """"""